# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]

from random import randint
N = int(input('Введите количество элементов в массиве A: '))
A = []
B = []
for i in range(N):
    A.append(randint(-50, 50))
print(A)
min_number = int(input('Введите нижнюю границу диапазона: '))
max_number = int(input('Введите верхнюю границу диапазона: '))
print(f"Индексы элементов в диапазоне [{min_number} , {max_number}] ")
for i in range(len(A)):
    if min_number <= A[i] <= max_number:
        B.append(i)
print(f"{B}", end=' ')
